Revit 2027 API
BuiltInFailures.FamilyFailures.FamilyDoesntMatchSystemPropertiesDisconnected Property
 The family no longer matches the properties for the System. Disconnect the family from the System?
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FamilyDoesntMatchSystemPropertiesDisconnected { get; }
Public Shared ReadOnly Property FamilyDoesntMatchSystemPropertiesDisconnected As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FamilyDoesntMatchSystemPropertiesDisconnected {
	FailureDefinitionId^ get ();
}
static member FamilyDoesntMatchSystemPropertiesDisconnected : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace